<a href="https://colab.research.google.com/github/ZiYu-Huang/Practices-for-Beginners/blob/main/Day8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

#索引
在Day7中，DataFrame在使用索引時，必須填入欄位名稱


但如果只想選取某個raw的資料，而不是一個columns，Day7的索引欄位名稱是沒辦法的


loc,iloc可以來解決此問題:選取想要的index與欄位，且能配合以前numpy所說過的索引方式來使用

pandas在索引時許多方法都與numpy一樣，可以自己多融會貫通

In [ ]:
test = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],columns=['one','two','thr','four'],index=['A','B','C','D'])
test

   one  two  thr  four
A    1    2    3     4
B    5    6    7     8
C    9   10   11    12
D   13   14   15    16

In [ ]:
test['one']

A     1
B     5
C     9
D    13
Name: one, dtype: int64

In [ ]:
test[['two','thr']]

   two  thr
A    2    3
B    6    7
C   10   11
D   14   15

loc
loc必須傳入index與欄位的名稱


DataFrame.loc[(index名稱),(columns名稱)]

In [ ]:
test = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],columns=['one','two','thr','four'],index=['A','B','C','D'])
test

   one  two  thr  four
A    1    2    3     4
B    5    6    7     8
C    9   10   11    12
D   13   14   15    16

In [ ]:
test.loc['C'] #選取index為C的raw #loc必須傳入index與欄位的名稱

one      9
two     10
thr     11
four    12
Name: C, dtype: int64

In [ ]:
test.loc[['A','C']]  #選取index為A,C的raw

   one  two  thr  four
A    1    2    3     4
C    9   10   11    12

In [ ]:
test.loc[:,'one'] #選取所有index ， 再選取它們的one欄位

A     1
B     5
C     9
D    13
Name: one, dtype: int64

In [ ]:
test.loc[test['two']>5 , ['one','two']] #選擇欄位two大於五的raw 再取出它們的欄位one、two的值

   one  two
B    5    6
C    9   10
D   13   14

iloc


iloc必須傳入的index與欄位的名稱都是整數


表示這時index索引、欄位索引都是0~N-1

In [ ]:
test = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]],columns=['one','two','thr','four'],index=['A','B','C','D'])
test

   one  two  thr  four
A    1    2    3     4
B    5    6    7     8
C    9   10   11    12
D   13   14   15    16

In [ ]:
test.iloc[1]

one     5
two     6
thr     7
four    8
Name: B, dtype: int64

In [ ]:
test.iloc[[1,2]]

   one  two  thr  four
B    5    6    7     8
C    9   10   11    12

In [ ]:
test.iloc[[1,2,3],[2,3]]

   thr  four
B    7     8
C   11    12
D   15    16